Repository: krolmic/happy_day
Catalog: lib/l10n/arb/app_*.arb
Languages: de, es, pl

# errorMessage
source: An error occurred
de: Ein Fehler ist aufgetreten
es: Se ha producido un error
pl: Wystąpił błąd

# onboardingButtonLabel
source: Get started
de: Los geht's
es: Empezar
pl: Rozpoczynamy

# onboardingHeadingAdd
source: Create Structures
de: Strukturen erstellen
es: Crear estructuras
pl: Twórz struktury

# onboardingDescriptionAdd
source: Start by designing a daily structure that suits your lifestyle and goals.
de: Beginne damit, eine tägliche Struktur zu gestalten, die zu deinem Lebensstil und deinen Zielen passt.
es: Empieza diseñando una estructura diaria que se adapte a tu estilo de vida y objetivos.
pl: Zacznij od zaprojektowania codziennej struktury dopasowanej do twojego stylu życia i celów.

# onboardingHeadingGenerate
source: Let AI Light the Way
de: Lass die KI den Weg weisen
es: Deja que la IA te guíe
pl: Pozwól, by AI poprowadziło

# onboardingDescriptionGenerate
source: Simplify planning with AI-powered suggestions tailored just for you.
de: Vereinfache die Planung mit KI-gestützten Vorschlägen, die genau zu dir passen.
es: Simplifica la planificación con sugerencias impulsadas por IA hechas para ti.
pl: Uprość planowanie dzięki sugestiom opartym na sztucznej inteligencji, dopasowanym specjalnie do ciebie.

# onboardingHeadingTrack
source: Build Habits That Stick
de: Gewohnheiten aufbauen, die bleiben
es: Construye hábitos que perduren
pl: Buduj nawyki, które zostaną

# onboardingDescriptionTrack
source: Track your progress, stay consistent, and complete tasks with ease.
de: Verfolge deinen Fortschritt, bleib konsequent und erledige Aufgaben mühelos.
es: Sigue tu progreso, mantente constante y completa tareas con facilidad.
pl: Śledź swoje postępy, bądź konsekwentny i łatwo realizuj zadania.

# editStructureAddAppBarTitle
source: New Structure
de: Neue Struktur
es: Añadir estructura
pl: Dodaj strukturę

# editStructureTitleLabel
source: Title
de: Titel
es: Título
pl: Tytuł

# editStructureTitleHint
source: Required structure name
de: Pflichtfeld, Titel der Struktur
es: Obligatorio, nombre de la estructura
pl: Wymagana nazwa struktury

# editStructureDescriptionLabel
source: Description
de: Beschreibung
es: Descripción
pl: Opis

# editStructureDescriptionHint
source: Optional details about the structure
de: Optionale Details über die Struktur
es: Detalles opcionales sobre la estructura
pl: Opcjonalne szczegóły dotyczące struktury

# editStructureColorLabel
source: Color
de: Farbe
pl: Kolor

# editStructureSelectColorLabel
source: Select a color
de: Wähle eine Farbe aus
es: Selecciona un color
pl: Wybierz kolor

# editStructurePreviewLabel
source: Preview
de: Vorschau
es: Vista previa
pl: Podgląd

# editStructureStepLabel
source: Step
de: Schritt
es: Paso
pl: Krok

# editStructureStepsGenerationLoadingMessage
source: Generating steps...
de: Schritte werden generiert...
es: Generando pasos...
pl: Kroki są generowane...

# editStructureStepsGenerationSuccessMessage
source: Steps generated successfully!
de: Schritte erfolgreich generiert!
es: Pasos generados correctamente!
pl: Kroki generowane pomyślnie!

# editStructureStepsGenerationFailureMessage
source: Failed to generate steps.
de: Fehler beim Generieren der Schritte.
es: Error al generar pasos.
pl: Błąd podczas generowania kroków.

# editStructureAddSuccessMessage
source: Structure added successfully!
de: Struktur erfolgreich hinzugefügt!
es: Estructura añadida correctamente!
pl: Struktura dodana pomyślnie!

# editStructureUpdateSuccessMessage
source: Structure updated successfully!
de: Struktur erfolgreich aktualisiert!
es: Estructura actualizada correctamente!
pl: Struktura zaktualizowana pomyślnie!

# structureDeletionSuccessMessage
source: Structure deleted successfully!
de: Struktur erfolgreich gelöscht!
es: Estructura eliminada correctamente!
pl: Struktura usunięta pomyślnie!

# structureCompletedMessage
source: Structure has been completed!
de: Struktur abgeschlossen!
es: Estructura completada!
pl: Struktura została ukończona!

source: Start Structure
de: Struktur starten
es: Iniciar estructura
pl: Rozpocznij strukturę

source: Reset Structure
de: Struktur zurücksetzen
es: Restablecer estructura
pl: Zresetuj strukturę

source: Edit Structure
de: Struktur bearbeiten
es: Editar estructura
pl: Edytuj strukturę

source: Complete
de: Weiter
es: Completar
pl: Ukończ

source: Undo
de: Zurück
es: Deshacer
pl: Cofnij

source: Settings
de: Einstellungen
pl: Ustawienia

source: Send Feedback
de: Teile dein Feedback
pl: Prześlij twoją opinie

source: Contact Support
de: Kontaktiere Support
pl: Kontakt z supportem

source: Privacy Policy
de: Datenschutz
pl: Polityka prywatności

# termsOfService
source: Terms and Conditions
de: Nutzungsbedingungen
pl: Warunki korzystania

source: Weekdays
de: Wochenstage
pl: Dni tygodnia

# mondayShort
source: Mo
pl: Po

# tuesdayShort
source: Tu
de: Di
pl: Wt

# wednesdayShort
source: We
de: Mi
pl: Sr

# thursdayShort
source: Th
de: Do
pl: Cz

# fridayShort
source: Fr
pl: Pi

# saturdayShort
source: Sa
pl: So

# sundayShort
source: Su
de: So
pl: Ni
